sendu2wfdx/RemoteBSP/firmware/boards/stm32g431cbu6/main.c
#include "stm32g4xx_hal.h"

#include "remotebsp_embedded/board_config.h"
#include "remotebsp_embedded/core.h"
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
#include "remotebsp_embedded/soft_half_duplex_uart.h"
#endif
#include "remotebsp_embedded/startup_gpio.h"
#ifdef CONFIG_USB_DEBUG_CDC
#include "remotebsp_embedded/usb_debug.h"
#endif

#include <string.h>

#if CONFIG_SYSTEM_CLOCK_HZ != 170000000
#error "STM32G431CBU6 当前时钟方案固定为 170MHz"
#endif

#if (170000000U % (CONFIG_CAN_NOMINAL_BITRATE * 34U)) != 0
#error "当前 G431 FDCAN 位时序无法精确生成所选仲裁段波特率"
#endif

#define FDCAN_NOMINAL_PRESCALER \
    (170000000U / (CONFIG_CAN_NOMINAL_BITRATE * 34U))

#ifdef CONFIG_CAN_FD_ENABLE
#if (170000000U % (CONFIG_CAN_FD_DATA_BITRATE * 17U)) != 0
#error "当前 G431 FDCAN 位时序无法精确生成所选数据段波特率"
#endif
#define FDCAN_DATA_PRESCALER \
    (170000000U / (CONFIG_CAN_FD_DATA_BITRATE * 17U))
#else
#define FDCAN_DATA_PRESCALER 10U
#endif

static FDCAN_HandleTypeDef fdcan_handle;
static rbsp_core_t remote_core;
static void fatal_error(void);

#ifdef CONFIG_REMOTEBSP_MOTION
#if (CONFIG_SYSTEM_CLOCK_HZ % CONFIG_MOTION_TIMER_HZ) != 0
#error "G431 运动定时器频率必须整除系统时钟"
#endif

#ifdef CONFIG_MOTION_SLOT0_ENABLED
#define MOTION_SLOT0_AXIS_COUNT 1U
#else
#define MOTION_SLOT0_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
#define MOTION_SLOT1_AXIS_COUNT 1U
#else
#define MOTION_SLOT1_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
#define MOTION_SLOT2_AXIS_COUNT 1U
#else
#define MOTION_SLOT2_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
#define MOTION_SLOT3_AXIS_COUNT 1U
#else
#define MOTION_SLOT3_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
#define MOTION_SLOT4_AXIS_COUNT 1U
#else
#define MOTION_SLOT4_AXIS_COUNT 0U
#endif

#define MOTION_SLOT_AXIS_COUNT \
    (MOTION_SLOT0_AXIS_COUNT + MOTION_SLOT1_AXIS_COUNT + \
     MOTION_SLOT2_AXIS_COUNT + MOTION_SLOT3_AXIS_COUNT + \
     MOTION_SLOT4_AXIS_COUNT)

#if MOTION_SLOT_AXIS_COUNT == 0U
#error "启用运动模块时至少要启用一个本板运动槽"
#endif
#if MOTION_SLOT_AXIS_COUNT > CONFIG_MOTION_MAX_AXES
#error "已启用的本板运动槽数量不能超过 MOTION_MAX_AXES"
#endif

typedef struct {
    uint8_t port;
    uint8_t pin;
} motion_pin_t;

typedef struct {
    motion_pin_t step;
    motion_pin_t direction;
    motion_pin_t enable;
    bool direction_inverted;
    bool enable_active_low;
} motion_axis_pins_t;

/* 槽位本身没有板名；所有引脚均由 menuconfig 生成。 */
static const motion_axis_pins_t motion_axis_pins[MOTION_SLOT_AXIS_COUNT] = {
#ifdef CONFIG_MOTION_SLOT0_ENABLED
    {{CONFIG_MOTION_SLOT0_STEP_PIN / 16U, CONFIG_MOTION_SLOT0_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT0_DIR_PIN / 16U, CONFIG_MOTION_SLOT0_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT0_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT0_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT0_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT0_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
    {{CONFIG_MOTION_SLOT1_STEP_PIN / 16U, CONFIG_MOTION_SLOT1_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT1_DIR_PIN / 16U, CONFIG_MOTION_SLOT1_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT1_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT1_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT1_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
    {{CONFIG_MOTION_SLOT2_STEP_PIN / 16U, CONFIG_MOTION_SLOT2_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT2_DIR_PIN / 16U, CONFIG_MOTION_SLOT2_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT2_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT2_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT2_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
    {{CONFIG_MOTION_SLOT3_STEP_PIN / 16U, CONFIG_MOTION_SLOT3_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT3_DIR_PIN / 16U, CONFIG_MOTION_SLOT3_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT3_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT3_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT3_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
    {{CONFIG_MOTION_SLOT4_STEP_PIN / 16U, CONFIG_MOTION_SLOT4_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT4_DIR_PIN / 16U, CONFIG_MOTION_SLOT4_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT4_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT4_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT4_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
};

static volatile uint32_t motion_timebase_epochs;
#endif

#ifdef CONFIG_WEACT_G431_PC6_PWM_BREATHING_LED
static TIM_HandleTypeDef led_pwm_timer;

enum {
    LED_PWM_PERIOD = 999U,
    LED_BREATH_PERIOD_MS = 4000U,
    LED_BREATH_HALF_PERIOD_MS = LED_BREATH_PERIOD_MS / 2U,
};

/* TIM3_CH1: PC6 (AF2)，定时器时钟 170MHz / 17 / 1000 = 10kHz。 */
static void led_pwm_configure(void) {
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_TIM3_CLK_ENABLE();

    GPIO_InitTypeDef pin = {0};
    pin.Pin = GPIO_PIN_6;
    pin.Mode = GPIO_MODE_AF_PP;
    pin.Pull = GPIO_NOPULL;
    pin.Speed = GPIO_SPEED_FREQ_LOW;
    pin.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOC, &pin);

    led_pwm_timer.Instance = TIM3;
    led_pwm_timer.Init.Prescaler = 16U;
    led_pwm_timer.Init.CounterMode = TIM_COUNTERMODE_UP;
    led_pwm_timer.Init.Period = LED_PWM_PERIOD;
    led_pwm_timer.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    led_pwm_timer.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    if (HAL_TIM_PWM_Init(&led_pwm_timer) != HAL_OK) {
        fatal_error();
    }

    TIM_OC_InitTypeDef channel = {0};
    channel.OCMode = TIM_OCMODE_PWM1;
    channel.Pulse = 0U;
    channel.OCPolarity = TIM_OCPOLARITY_HIGH;
    channel.OCFastMode = TIM_OCFAST_DISABLE;
    if (HAL_TIM_PWM_ConfigChannel(
            &led_pwm_timer, &channel, TIM_CHANNEL_1) != HAL_OK ||
        HAL_TIM_PWM_Start(&led_pwm_timer, TIM_CHANNEL_1) != HAL_OK) {
        fatal_error();
    }
}

static void led_pwm_poll(void) {
    const uint32_t phase = HAL_GetTick() % LED_BREATH_PERIOD_MS;
    uint32_t linear = phase < LED_BREATH_HALF_PERIOD_MS
                          ? phase
                          : LED_BREATH_PERIOD_MS - phase;
    linear = (linear * LED_PWM_PERIOD) / LED_BREATH_HALF_PERIOD_MS;
    /* 二次曲线改善低亮度区域的视觉平滑度，避免浮点运算。 */
    const uint32_t duty = (linear * linear) / LED_PWM_PERIOD;
    __HAL_TIM_SET_COMPARE(&led_pwm_timer, TIM_CHANNEL_1, duty);
}
#endif

static void put_u32(uint8_t* output, uint32_t value) {
    output[0] = (uint8_t)value;
    output[1] = (uint8_t)(value >> 8U);
    output[2] = (uint8_t)(value >> 16U);
    output[3] = (uint8_t)(value >> 24U);
}

