sendu2wfdx/RemoteBSP/firmware/boards/stm32g431cbu6/main.c
static bool board_gpio_write(uint16_t encoded_pin, bool value) {
    if (!gpio_pin_allowed(encoded_pin) ||
        gpio_pin_reserved_by_board(encoded_pin)) {
        return false;
    }
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    HAL_GPIO_WritePin(
        port, (uint16_t)(1U << (encoded_pin % 16U)),
        value ? GPIO_PIN_SET : GPIO_PIN_RESET);
    return true;
}

static bool board_gpio_read(uint16_t encoded_pin, bool* value) {
    if (!gpio_pin_allowed(encoded_pin) ||
        gpio_pin_reserved_by_board(encoded_pin) || value == NULL) {
        return false;
    }
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    *value = HAL_GPIO_ReadPin(
                 port, (uint16_t)(1U << (encoded_pin % 16U))) ==
             GPIO_PIN_SET;
    return true;
}

#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
/* 每个已启用 TMC2209 槽位各占用一条单线半双工 UART。 */
enum { RBSP_SOFT_UART_SLOT_CAPACITY = 5U };

static rbsp_soft_half_duplex_uart_t soft_uart;
static const bool soft_uart_port_present[RBSP_SOFT_UART_SLOT_CAPACITY] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
};

static const uint8_t soft_uart_gpio_ports[RBSP_SOFT_UART_SLOT_CAPACITY] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT0_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT1_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT2_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT3_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT4_TMC_UART_PIN / 16U,
#else
    0U,
#endif
};

static const uint8_t soft_uart_gpio_pins[RBSP_SOFT_UART_SLOT_CAPACITY] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT0_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT1_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT2_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT3_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT4_TMC_UART_PIN % 16U,
#else
    0U,
#endif
};

static bool soft_uart_pin_reserved(uint16_t encoded_pin) {
    for (uint8_t port = 0U;
         port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
         port < RBSP_SOFT_UART_SLOT_CAPACITY;
         ++port) {
        if (soft_uart_port_present[port] &&
            encoded_pin == (uint16_t)(soft_uart_gpio_ports[port] * 16U +
                                      soft_uart_gpio_pins[port])) {
            return true;
        }
    }
    return false;
}

static bool soft_uart_configuration_valid(bool used[64]) {
    for (uint8_t port = 0U;
         port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
         port < RBSP_SOFT_UART_SLOT_CAPACITY;
         ++port) {
        if (!soft_uart_port_present[port]) {
            continue;
        }
        const uint16_t encoded_pin =
            (uint16_t)(soft_uart_gpio_ports[port] * 16U +
                       soft_uart_gpio_pins[port]);
        if (encoded_pin >= 64U || used[encoded_pin] ||
            !gpio_pin_present(encoded_pin) ||
            gpio_pin_reserved_by_board(encoded_pin)) {
            return false;
        }
        used[encoded_pin] = true;
    }
    return true;
}

static GPIO_TypeDef* soft_uart_gpio(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < RBSP_SOFT_UART_SLOT_CAPACITY &&
                   soft_uart_port_present[port]
               ? gpio_port_from_index(soft_uart_gpio_ports[port])
               : NULL;
}

static uint16_t soft_uart_mask(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < RBSP_SOFT_UART_SLOT_CAPACITY &&
                   soft_uart_port_present[port]
               ? (uint16_t)(1U << soft_uart_gpio_pins[port])
               : 0U;
}

static bool soft_uart_port_prepare(void* context, uint8_t port) {
    (void)context;
    if (soft_uart_gpio(port) == NULL || soft_uart_mask(port) == 0U) {
        return false;
    }
    enable_gpio_clock(soft_uart_gpio_ports[port]);
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
    return true;
}

static bool soft_uart_set_input(void* context, uint8_t port) {
    (void)context;
    GPIO_TypeDef* const gpio = soft_uart_gpio(port);
    const uint16_t mask = soft_uart_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_PULLUP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

static bool soft_uart_set_output(void* context, uint8_t port, bool high) {
    (void)context;
    GPIO_TypeDef* const gpio = soft_uart_gpio(port);
    const uint16_t mask = soft_uart_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    gpio->BSRR = high ? mask : (uint32_t)mask << 16U;
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

static bool soft_uart_read_input(void* context, uint8_t port, bool* high) {
    (void)context;
    GPIO_TypeDef* const gpio = soft_uart_gpio(port);
    const uint16_t mask = soft_uart_mask(port);
    if (gpio == NULL || mask == 0U || high == NULL) {
        return false;
    }
    *high = (gpio->IDR & mask) != 0U;
    return true;
}

static void soft_uart_delay_ticks(void* context, uint32_t ticks) {
    (void)context;
    const uint32_t started = DWT->CYCCNT;
    while ((uint32_t)(DWT->CYCCNT - started) < ticks) {
    }
}

static uint32_t soft_uart_irq_save_disable(void* context) {
    (void)context;
    const uint32_t state = __get_PRIMASK();
    __disable_irq();
    return state;
}

static void soft_uart_irq_restore(void* context, uint32_t state) {
    (void)context;
    if (state == 0U) {
        __enable_irq();
    }
}

static bool board_soft_uart_configure(uint8_t port, uint32_t baud,
                                      uint8_t bits, uint8_t stop,
                                      uint8_t parity) {
    return rbsp_soft_half_duplex_uart_configure(
        &soft_uart, port, baud, bits, stop, parity);
}

static size_t board_soft_uart_read(uint8_t port, uint8_t* data,
                                   size_t capacity) {
    return rbsp_soft_half_duplex_uart_read(&soft_uart, port, data, capacity);
}

static bool board_soft_uart_write(uint8_t port, const uint8_t* data,
                                  size_t length) {
#ifdef CONFIG_REMOTEBSP_MOTION
    if (remote_core.motion.state == RBSP_MOTION_ARMED ||
        remote_core.motion.state == RBSP_MOTION_RUNNING) {
        return false;
    }
#endif
    return rbsp_soft_half_duplex_uart_write(&soft_uart, port, data, length);
}
#endif

