sendu2wfdx/RemoteBSP/firmware/boards/stm32g431cbu6/main.c
#ifdef CONFIG_REMOTEBSP_MOTION
static void motion_write_pin(motion_pin_t pin, bool high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    gpio->BSRR = high ? mask : (uint32_t)mask << 16U;
}

static void motion_configure_output(motion_pin_t pin, bool initial_high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    enable_gpio_clock(pin.port);
    motion_write_pin(pin, initial_high);
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
}

/* 上电先关闭每一路 EN，再把 STEP 固定为低，避免复位和初始化期间误动作。 */
static void motion_outputs_configure(void) {
    for (uint8_t axis = 0U; axis < MOTION_SLOT_AXIS_COUNT; ++axis) {
        const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
        motion_configure_output(pins->enable, pins->enable_active_low);
        motion_configure_output(pins->step, false);
        motion_configure_output(pins->direction,
                                pins->direction_inverted);
    }
}

static bool board_motion_set_enable(uint8_t axis, bool enabled) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
    motion_write_pin(pins->enable, enabled != pins->enable_active_low);
    return true;
}

static bool board_motion_set_direction(uint8_t axis, bool positive) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
    motion_write_pin(pins->direction,
                     positive != pins->direction_inverted);
    return true;
}

static bool board_motion_set_step(uint8_t axis, bool high) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    motion_write_pin(motion_axis_pins[axis].step, high);
    return true;
}

/* TIM2 以 1MHz 自由运行，结合溢出中断构成单调的 64 位运动时钟。 */
static void motion_timebase_configure(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    TIM2->CR1 = 0U;
    TIM2->PSC = 169U;
    TIM2->ARR = UINT32_MAX;
    TIM2->EGR = TIM_EGR_UG;
    TIM2->CNT = 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;
    motion_timebase_epochs = 0U;
    HAL_NVIC_SetPriority(TIM2_IRQn, 1U, 0U);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    TIM2->CR1 = TIM_CR1_CEN;
}

static uint64_t board_motion_nanoseconds(void) {
    uint32_t before;
    uint32_t after;
    uint32_t counter;
    do {
        before = motion_timebase_epochs;
        counter = TIM2->CNT;
        after = motion_timebase_epochs;
    } while (before != after);
    if ((TIM2->SR & TIM_SR_UIF) != 0U &&
        counter < UINT32_C(0x80000000)) {
        ++after;
    }
    return (((uint64_t)after << 32U) | counter) * 1000ULL;
}

/* TIM4 专供 STEP 调度；不占用 PC6 的 TIM3 呼吸灯。 */
static void motion_tick_timer_start(void) {
    __HAL_RCC_TIM4_CLK_ENABLE();
    TIM4->CR1 = 0U;
    TIM4->PSC = 0U;
    TIM4->ARR =
        (uint16_t)(CONFIG_SYSTEM_CLOCK_HZ / CONFIG_MOTION_TIMER_HZ - 1U);
    TIM4->EGR = TIM_EGR_UG;
    TIM4->CNT = 0U;
    TIM4->SR = 0U;
    TIM4->DIER = TIM_DIER_UIE;
    HAL_NVIC_SetPriority(TIM4_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM4_IRQn);
    TIM4->CR1 = TIM_CR1_CEN;
}
#endif

void HAL_FDCAN_MspInit(FDCAN_HandleTypeDef* handle) {
    if (handle->Instance != FDCAN1) {
        return;
    }
    __HAL_RCC_FDCAN_CLK_ENABLE();
    GPIO_InitTypeDef init = {0};
    init.Mode = GPIO_MODE_AF_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    init.Alternate = GPIO_AF9_FDCAN1;
#if defined(CONFIG_CAN_PINS_PA11_PA12)
    __HAL_RCC_GPIOA_CLK_ENABLE();
    init.Pin = GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_Init(GPIOA, &init);
#else
    __HAL_RCC_GPIOB_CLK_ENABLE();
    init.Pin = GPIO_PIN_8 | GPIO_PIN_9;
    HAL_GPIO_Init(GPIOB, &init);
#endif
}

static void fdcan_configure(void) {
    fdcan_handle.Instance = FDCAN1;
#ifdef CONFIG_CAN_FD_ENABLE
    fdcan_handle.Init.FrameFormat = FDCAN_FRAME_FD_BRS;
#else
    fdcan_handle.Init.FrameFormat = FDCAN_FRAME_CLASSIC;
#endif
    fdcan_handle.Init.Mode = FDCAN_MODE_NORMAL;
    fdcan_handle.Init.AutoRetransmission = ENABLE;
    fdcan_handle.Init.TransmitPause = DISABLE;
    fdcan_handle.Init.ProtocolException = ENABLE;
    fdcan_handle.Init.NominalPrescaler = FDCAN_NOMINAL_PRESCALER;
    /* 34 TQ，采样点为 (1 + 29) / 34 = 88.24%，与常见 USB-CAN 的 87.5% 对齐。 */
    fdcan_handle.Init.NominalSyncJumpWidth = 4U;
    fdcan_handle.Init.NominalTimeSeg1 = 29U;
    fdcan_handle.Init.NominalTimeSeg2 = 4U;
    fdcan_handle.Init.DataPrescaler = FDCAN_DATA_PRESCALER;
    fdcan_handle.Init.DataSyncJumpWidth = 3U;
    fdcan_handle.Init.DataTimeSeg1 = 13U;
    fdcan_handle.Init.DataTimeSeg2 = 3U;
    fdcan_handle.Init.StdFiltersNbr = 1U;
    fdcan_handle.Init.ExtFiltersNbr = 0U;
    fdcan_handle.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
    if (HAL_FDCAN_Init(&fdcan_handle) != HAL_OK) {
        fatal_error();
    }

    FDCAN_FilterTypeDef filter = {0};
    filter.IdType = FDCAN_STANDARD_ID;
    filter.FilterIndex = 0U;
    filter.FilterType = FDCAN_FILTER_MASK;
    filter.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
    filter.FilterID1 = 0U;
    filter.FilterID2 = 0U;
    if (HAL_FDCAN_ConfigFilter(&fdcan_handle, &filter) != HAL_OK ||
        HAL_FDCAN_ConfigGlobalFilter(
            &fdcan_handle, FDCAN_REJECT, FDCAN_REJECT,
            FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE) != HAL_OK ||
        HAL_FDCAN_Start(&fdcan_handle) != HAL_OK) {
        fatal_error();
    }
}

static uint32_t fdcan_dlc_from_length(uint8_t length) {
    static const uint32_t dlc[] = {
        FDCAN_DLC_BYTES_0, FDCAN_DLC_BYTES_1, FDCAN_DLC_BYTES_2,
        FDCAN_DLC_BYTES_3, FDCAN_DLC_BYTES_4, FDCAN_DLC_BYTES_5,
        FDCAN_DLC_BYTES_6, FDCAN_DLC_BYTES_7, FDCAN_DLC_BYTES_8};
    if (length <= 8U) {
        return dlc[length];
    }
    switch (length) {
        case 12U:
            return FDCAN_DLC_BYTES_12;
        case 16U:
            return FDCAN_DLC_BYTES_16;
        case 20U:
            return FDCAN_DLC_BYTES_20;
        case 24U:
            return FDCAN_DLC_BYTES_24;
        case 32U:
            return FDCAN_DLC_BYTES_32;
        case 48U:
            return FDCAN_DLC_BYTES_48;
        case 64U:
            return FDCAN_DLC_BYTES_64;
        default:
            return UINT32_MAX;
    }
}

