sendu2wfdx/RemoteBSP/firmware/boards/stm32g431cbu6/main.c
static uint8_t fdcan_length_from_dlc(uint32_t dlc) {
    static const uint8_t lengths[] = {
        0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U,
        8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U};
    return dlc < sizeof(lengths) ? lengths[dlc] : 0xFFU;
}

static bool board_can_send(const rbsp_can_frame_t* frame) {
    if (frame == NULL || frame->identifier > 0x7FFU) {
        return false;
    }
    const uint32_t dlc = fdcan_dlc_from_length(frame->length);
    if (dlc == UINT32_MAX) {
        return false;
    }
    const uint32_t started = HAL_GetTick();
    while (HAL_FDCAN_GetTxFifoFreeLevel(&fdcan_handle) == 0U) {
        if ((uint32_t)(HAL_GetTick() - started) >= 20U) {
            return false;
        }
    }

    FDCAN_TxHeaderTypeDef header = {0};
    header.Identifier = frame->identifier;
    header.IdType = FDCAN_STANDARD_ID;
    header.TxFrameType = FDCAN_DATA_FRAME;
    header.DataLength = dlc;
    header.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
#ifdef CONFIG_CAN_FD_ENABLE
    header.BitRateSwitch = FDCAN_BRS_ON;
    header.FDFormat = FDCAN_FD_CAN;
#else
    header.BitRateSwitch = FDCAN_BRS_OFF;
    header.FDFormat = FDCAN_CLASSIC_CAN;
#endif
    header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
    header.MessageMarker = 0U;
    return HAL_FDCAN_AddMessageToTxFifoQ(
               &fdcan_handle, &header,
               (uint8_t*)frame->data) == HAL_OK;
}

static void receive_can_frames(void) {
    while (HAL_FDCAN_GetRxFifoFillLevel(
               &fdcan_handle, FDCAN_RX_FIFO0) != 0U) {
        FDCAN_RxHeaderTypeDef header = {0};
        rbsp_can_frame_t frame = {0};
        if (HAL_FDCAN_GetRxMessage(&fdcan_handle, FDCAN_RX_FIFO0,
                                   &header, frame.data) != HAL_OK) {
            return;
        }
        const uint8_t length =
            fdcan_length_from_dlc(header.DataLength);
        if (header.IdType != FDCAN_STANDARD_ID ||
            header.RxFrameType != FDCAN_DATA_FRAME ||
            length == 0xFFU) {
            continue;
        }
        frame.identifier = header.Identifier;
        frame.length = length;
        rbsp_core_accept_can(&remote_core, &frame);
    }
}

static void make_node_info(rbsp_node_info_t* info) {
    memset(info, 0, sizeof(*info));
    put_u32(info->uuid + 0U, HAL_GetUIDw0());
    put_u32(info->uuid + 4U, HAL_GetUIDw1());
    put_u32(info->uuid + 8U, HAL_GetUIDw2());
    put_u32(info->uuid + 12U, CONFIG_BOARD_TYPE);
    info->firmware_major = CONFIG_FIRMWARE_VERSION_MAJOR;
    info->firmware_minor = CONFIG_FIRMWARE_VERSION_MINOR;
    info->firmware_patch = CONFIG_FIRMWARE_VERSION_PATCH;
    info->board_type = CONFIG_BOARD_TYPE;
}

int main(void) {
    SCB->VTOR = FLASH_BASE + CONFIG_APPLICATION_FLASH_OFFSET;
    __DSB();
    __ISB();
    HAL_Init();
    system_clock_configure();
#if defined(CONFIG_REMOTEBSP_MOTION) || \
    defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
    if (!motion_slot_configuration_valid()) {
        fatal_error();
    }
#endif
    startup_gpio_configure();
#ifdef CONFIG_WEACT_G431_PC6_PWM_BREATHING_LED
    led_pwm_configure();
#endif
#ifdef CONFIG_REMOTEBSP_MOTION
    motion_outputs_configure();
    motion_timebase_configure();
#endif
    transceiver_enable();
    fdcan_configure();
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    const rbsp_soft_half_duplex_uart_hal_t soft_uart_hal = {
        .context = NULL,
        .port_prepare = soft_uart_port_prepare,
        .set_output = soft_uart_set_output,
        .set_input = soft_uart_set_input,
        .read_input = soft_uart_read_input,
        .timing_hz = CONFIG_SYSTEM_CLOCK_HZ,
        .delay_ticks = soft_uart_delay_ticks,
        .irq_save_disable = soft_uart_irq_save_disable,
        .irq_restore = soft_uart_irq_restore,
    };
    if (!rbsp_soft_half_duplex_uart_init(&soft_uart, &soft_uart_hal)) {
        fatal_error();
    }
#endif
#ifdef CONFIG_USB_DEBUG_CDC
    if (rbsp_usb_debug_init()) {
        (void)rbsp_usb_debug_write_text(
            "RemoteBSP STM32G431 APP ready\r\n");
    }
#endif

    rbsp_node_info_t info;
    make_node_info(&info);
    const rbsp_hal_t hal = {
        .can_send = board_can_send,
        .milliseconds = HAL_GetTick,
        .gpio_configure = board_gpio_configure,
        .gpio_write = board_gpio_write,
        .gpio_read = board_gpio_read,
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
        .uart_configure = board_soft_uart_configure,
        .uart_read = board_soft_uart_read,
        .uart_write = board_soft_uart_write,
#endif
#ifdef CONFIG_REMOTEBSP_MOTION
        .nanoseconds = board_motion_nanoseconds,
        .motion_axis_count = MOTION_SLOT_AXIS_COUNT,
        .motion_set_enable = board_motion_set_enable,
        .motion_set_direction = board_motion_set_direction,
        .motion_set_step = board_motion_set_step,
#endif
#ifdef CONFIG_APP_LAYOUT_KATAPULT_8K
        .enter_bootloader = board_enter_bootloader,
#endif
    };
#ifdef CONFIG_CAN_FD_ENABLE
    const rbsp_can_mode_t mode = RBSP_CAN_FD;
#else
    const rbsp_can_mode_t mode = RBSP_CAN_CLASSICAL;
#endif
    if (!rbsp_core_init(&remote_core, &hal, mode, &info)) {
        fatal_error();
    }
#ifdef CONFIG_REMOTEBSP_MOTION
    motion_tick_timer_start();
#endif

    for (;;) {
        receive_can_frames();
        rbsp_core_poll(&remote_core);
#ifdef CONFIG_WEACT_G431_PC6_PWM_BREATHING_LED
        led_pwm_poll();
#endif
#ifdef CONFIG_USB_DEBUG_CDC
        rbsp_usb_debug_poll();
#endif
    }
}

void SysTick_Handler(void) {
    HAL_IncTick();
}

#ifdef CONFIG_REMOTEBSP_MOTION
void TIM2_IRQHandler(void) {
    if ((TIM2->SR & TIM_SR_UIF) != 0U) {
        TIM2->SR &= ~TIM_SR_UIF;
        ++motion_timebase_epochs;
    }
}

void TIM4_IRQHandler(void) {
    if ((TIM4->SR & TIM_SR_UIF) != 0U) {
        TIM4->SR &= ~TIM_SR_UIF;
        if (remote_core.motion.state == RBSP_MOTION_ARMED ||
            remote_core.motion.state == RBSP_MOTION_RUNNING) {
            (void)rbsp_core_motion_tick(&remote_core);
        }
    }
}
#endif

#ifdef CONFIG_USB_DEBUG_CDC
void USB_LP_IRQHandler(void) {
    rbsp_usb_debug_irq_handler();
}

void USB_HP_IRQHandler(void) {
    rbsp_usb_debug_irq_handler();
}
#endif
